// Задача №7. Напишите программу, которая принимает на вход трёхзначное число и на выходе показывает последнюю цифру этого числа.
// 	456 -> 6
// 	782 -> 2
// 	918 -> 8


switch (number) {
    case 1:
    Console.WriteLine();
    break; 

    case 2:
    Console.WriteLine();
    break;

    default:
    Console.WriteLine();
    break;
}
